In [19]:
import pandas as pd
import numpy as np

In [91]:
exam1 = [89,85,93,83]
labels = ['studentA', 'studentB', 'studentC', 'studentD']
pd.Series(exam1, labels)

studentA    89
studentB    85
studentC    93
studentD    83
dtype: int64

In [92]:
pd.Series(exam1, labels)['studentD']

83

In [93]:
d={s:p for s,p in zip(labels, exam1)}
d

{'studentA': 89, 'studentB': 85, 'studentC': 93, 'studentD': 83}

In [94]:
pd.Series(d)

studentA    89
studentB    85
studentC    93
studentD    83
dtype: int64

In [95]:
exam2 = [74,56,44,92]
e1 = pd.Series(exam1, labels)
e2 = pd.Series(exam2, labels)
e1+e2

studentA    163
studentB    141
studentC    137
studentD    175
dtype: int64

In [96]:
e1/5

studentA    17.8
studentB    17.0
studentC    18.6
studentD    16.6
dtype: float64

In [97]:
df = pd.DataFrame({'e1':exam1, 'e2':exam2}, index = labels)
df

          e1  e2
studentA  89  74
studentB  85  56
studentC  93  44
studentD  83  92

In [98]:
df['e2']

studentA    74
studentB    56
studentC    44
studentD    92
Name: e2, dtype: int64

In [99]:
data = np.array([exam1, exam2])
data

array([[89, 85, 93, 83],
       [74, 56, 44, 92]])

In [100]:
df = pd.DataFrame(data.transpose(), index = labels, columns = ['e1', 'e2'])
df

          e1  e2
studentA  89  74
studentB  85  56
studentC  93  44
studentD  83  92

In [101]:
df[['e1', 'e2']]

          e1  e2
studentA  89  74
studentB  85  56
studentC  93  44
studentD  83  92

In [102]:
df['e3'] = [67, 59, 79, 84]
df

          e1  e2  e3
studentA  89  74  67
studentB  85  56  59
studentC  93  44  79
studentD  83  92  84

In [103]:
df['e3']

studentA    67
studentB    59
studentC    79
studentD    84
Name: e3, dtype: int64

In [104]:
df['semestr1'] = df['e1'] + df['e2'] + df['e3']
df

          e1  e2  e3  semestr1
studentA  89  74  67       230
studentB  85  56  59       200
studentC  93  44  79       216
studentD  83  92  84       259

In [105]:
df.loc['studentA']

e1           89
e2           74
e3           67
semestr1    230
Name: studentA, dtype: int64

In [106]:
df.loc['studentA', 'e1']

89

In [107]:
df.loc[['studentA'], ['e3']]

          e3
studentA  67

In [108]:
df.iloc[:2 , 1:]

          e2  e3  semestr1
studentA  74  67       230
studentB  56  59       200

In [109]:
df

          e1  e2  e3  semestr1
studentA  89  74  67       230
studentB  85  56  59       200
studentC  93  44  79       216
studentD  83  92  84       259

In [110]:
df['e2']>70

studentA     True
studentB    False
studentC    False
studentD     True
Name: e2, dtype: bool

In [111]:
df[df['e2']>70]

          e1  e2  e3  semestr1
studentA  89  74  67       230
studentD  83  92  84       259

In [112]:
df[(df['e2'] <50) | (df['e2'] >90)]

          e1  e2  e3  semestr1
studentC  93  44  79       216
studentD  83  92  84       259

In [113]:
df

          e1  e2  e3  semestr1
studentA  89  74  67       230
studentB  85  56  59       200
studentC  93  44  79       216
studentD  83  92  84       259

In [121]:
df_new_index = df.reset_index()
df_new_index

      index  e1  e2  e3  semestr1
0  studentA  89  74  67       230
1  studentB  85  56  59       200
2  studentC  93  44  79       216
3  studentD  83  92  84       259

In [123]:
df_new_index.index = ['ola', 'ala', 'ela', 'ula']
df_new_index

        index  e1  e2  e3  semestr1
ola  studentA  89  74  67       230
ala  studentB  85  56  59       200
ela  studentC  93  44  79       216
ula  studentD  83  92  84       259

In [124]:
df.rename(columns={'e1':'exam1', 'e2':'exam2', 'e3':'exam3'})

          exam1  exam2  exam3  semestr1
studentA     89     74     67       230
studentB     85     56     59       200
studentC     93     44     79       216
studentD     83     92     84       259

In [125]:
df.rename(index = {'studentA': 'Ala'})

          e1  e2  e3  semestr1
Ala       89  74  67       230
studentB  85  56  59       200
studentC  93  44  79       216
studentD  83  92  84       259

In [128]:
df.rename(str.upper, axis = 0)

          e1  e2  e3  semestr1
STUDENTA  89  74  67       230
STUDENTB  85  56  59       200
STUDENTC  93  44  79       216
STUDENTD  83  92  84       259

In [129]:
df = pd.DataFrame({'A':[100,44,56,99,85,100],
                  'B':['Panda','Snake','Snake','Rat','Dog','Panda']})
df

     A      B
0  100  Panda
1   44  Snake
2   56  Snake
3   99    Rat
4   85    Dog
5  100  Panda

In [133]:
df['B'].nunique()

4

In [135]:
df['A'].value_counts()

100    2
44     1
56     1
99     1
85     1
Name: A, dtype: int64

In [138]:
df.sort_values(by = 'A', ascending = False)

     A      B
0  100  Panda
5  100  Panda
3   99    Rat
4   85    Dog
2   56  Snake
1   44  Snake

In [139]:
df.drop_duplicates()

     A      B
0  100  Panda
1   44  Snake
2   56  Snake
3   99    Rat
4   85    Dog

In [140]:
df.drop_duplicates(subset = 'B')

     A      B
0  100  Panda
1   44  Snake
3   99    Rat
4   85    Dog

In [156]:
exam1 = [89,85,93,83]
exam2 = [74,56,44,92]
exam3=[67,59,79,84]
df = pd.DataFrame({'e1':exam1, 'e2':exam2, 'e3':exam3}, index=labels)
df['semester1'] = df['e1']+df['e2']+df['e3']
df

          e1  e2  e3  semester1
studentA  89  74  67        230
studentB  85  56  59        200
studentC  93  44  79        216
studentD  83  92  84        259

In [157]:
df.set_index([pd.Index(['high school x', 'high school x', 'high school y', 'high school y']), df.index], inplace = True)

In [158]:
df

                        e1  e2  e3  semester1
high school x studentA  89  74  67        230
              studentB  85  56  59        200
high school y studentC  93  44  79        216
              studentD  83  92  84        259

In [161]:
df.index.names = ['School', 'Student']
df

                        e1  e2  e3  semester1
School        Student
high school x studentA  89  74  67        230
              studentB  85  56  59        200
high school y studentC  93  44  79        216
              studentD  83  92  84        259

In [168]:
df.loc['high school y'].iloc[1]

e1            83
e2            92
e3            84
semester1    259
Name: studentD, dtype: int64

In [170]:
df.xs(('high school x', 'studentB'))

e1            85
e2            56
e3            59
semester1    200
Name: (high school x, studentB), dtype: int64

In [171]:
df

                        e1  e2  e3  semester1
School        Student
high school x studentA  89  74  67        230
              studentB  85  56  59        200
high school y studentC  93  44  79        216
              studentD  83  92  84        259

In [174]:
e4 = np.random.randint(1, 101, 4)
e5 = np.random.randint(1,101,4)
e6 = np.random.randint(1,101,4)
e4, e5, e6

(array([18, 85, 54, 37]), array([ 2, 48, 14, 37]), array([27, 38, 63, 46]))

In [175]:
df['e4'] = e4

In [177]:
df['e5'] = e5
df['e6'] = e6

In [178]:
df

                        e1  e2  e3  semester1  e4  e5  e6
School        Student
high school x studentA  89  74  67        230  18   2  27
              studentB  85  56  59        200  85  48  38
high school y studentC  93  44  79        216  54  14  63
              studentD  83  92  84        259  37  37  46

In [181]:
df.drop('semester1', axis = 1, inplace=True)
df

                        e1  e2  e3  e4  e5  e6
School        Student
high school x studentA  89  74  67  18   2  27
              studentB  85  56  59  85  48  38
high school y studentC  93  44  79  54  14  63
              studentD  83  92  84  37  37  46

In [189]:
dft = df.transpose()
dft

School  high school x          high school y
Student      studentA studentB      studentC studentD
e1                 89       85            93       83
e2                 74       56            44       92
e3                 67       59            79       84
e4                 18       85            54       37
e5                  2       48            14       37
e6                 27       38            63       46

In [191]:
indices = [('semester1', 'e1'), ('semester1', 'e2'), ('semester1', 'e3'), ('semester2', 'e4'), ('semester2', 'e5'), ('semester2', 'e6')]
indices

[('semester1', 'e1'),
 ('semester1', 'e2'),
 ('semester1', 'e3'),
 ('semester2', 'e4'),
 ('semester2', 'e5'),
 ('semester2', 'e6')]

In [195]:
dft.index = pd.MultiIndex.from_tuples(indices, names=['semester', 'exam'])
dft

School         high school x          high school y
Student             studentA studentB      studentC studentD
semester  exam
semester1 e1              89       85            93       83
          e2              74       56            44       92
          e3              67       59            79       84
semester2 e4              18       85            54       37
          e5               2       48            14       37
          e6              27       38            63       46

In [197]:
dft.loc['semester1'].iloc[1]

School         Student
high school x  studentA    74
               studentB    56
high school y  studentC    44
               studentD    92
Name: e2, dtype: int64

In [199]:
dft.xs(('semester1', 'e1'))

School         Student
high school x  studentA    89
               studentB    85
high school y  studentC    93
               studentD    83
Name: (semester1, e1), dtype: int64